reading-notes/how-interview-company.org
#+TITLE: 如何面试一家公司
#+SETUPFILE: ../setup/theme-readtheorg-local.setup
#+OPTIONS: toc:nil

本文是 [[https://medium.freecodecamp.com/how-to-interview-as-a-developer-candidate-b666734f12dd][How to interview a company]] 的阅读笔记。面试是双向的过程，公司在面试候选人，候选人也在默默观察公司。通常一个面试官在面试结束时，会问候选人有什么想了解的。作者给出了自己积攒多年的问题，候选人可以通过这些问题了解公司，面试官也可以通过这些问题看看自己部门是否符合候选人的标准。

对不同的面试官有不同的问题，同一个问题也会问不同的面试官，然后对比这些面试官的答案。

* 面向软件工程师的问题

** 如何了解自己每天需要做什么
通过这个可以了解公司的工作是否有计划，团队内部的配合是否流畅

** 使用什么样的版本控制工具
通过版本控制工具，可以延伸到开发工具，上线流程，质量保证等，可以观察公司的技术栈是否陈旧，自动化程度是否高。

** 这个工作吸引你的地方
如果连面试官都不清楚这份工作吸引他的地方，那就微妙了。

** 如何写测试，如何持续集成，如何发现修理bug
热心测试是个好信号，但也要了解测试的程度，对质量的要求，衡量标准，自动化程度等

* 面向工程师主管的问题

** 你最后一次写代码是什么时候
很多人喜欢技术背景比较强的主管

** 你如何安排工作

** 团队目前最大的挑战是什么

** 如何考核员工
