blogs/how-interview-company.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何面试一家公司</title>
<!-- 2017-05-20 六 17:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">如何面试一家公司</h1>
<p>
本文是 <a href="https://medium.freecodecamp.com/how-to-interview-as-a-developer-candidate-b666734f12dd">How to interview a company</a> 的阅读笔记。面试是双向的过程，公司在面试候选人，候选人也在默默观察公司。通常一个面试官在面试结束时，会问候选人有什么想了解的。作者给出了自己积攒多年的问题，候选人可以通过这些问题了解公司，面试官也可以通过这些问题看看自己部门是否符合候选人的标准。
</p>

<p>
对不同的面试官有不同的问题，同一个问题也会问不同的面试官，然后对比这些面试官的答案。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 面向软件工程师的问题</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 如何了解自己每天需要做什么</h3>
<div class="outline-text-3" id="text-1-1">
<p>
通过这个可以了解公司的工作是否有计划，团队内部的配合是否流畅
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 使用什么样的版本控制工具</h3>
<div class="outline-text-3" id="text-1-2">
<p>
通过版本控制工具，可以延伸到开发工具，上线流程，质量保证等，可以观察公司的技术栈是否陈旧，自动化程度是否高。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 这个工作吸引你的地方</h3>
<div class="outline-text-3" id="text-1-3">
<p>
如果连面试官都不清楚这份工作吸引他的地方，那就微妙了。
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 如何写测试，如何持续集成，如何发现修理bug</h3>
<div class="outline-text-3" id="text-1-4">
<p>
热心测试是个好信号，但也要了解测试的程度，对质量的要求，衡量标准，自动化程度等
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 面向工程师主管的问题</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 你最后一次写代码是什么时候</h3>
<div class="outline-text-3" id="text-2-1">
<p>
很多人喜欢技术背景比较强的主管
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 你如何安排工作</h3>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 团队目前最大的挑战是什么</h3>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 如何考核员工</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2017-05-20 六 17:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
